#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
data.google_client_config.provider: Reading...
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.prod_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.stg_apps.kubernetes_deployment.auth_microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.prod_apps.kubernetes_deployment.app_front is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "app_front" {
      ~ id               = "greenmile-prod/app-front" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                )
            } -> null
          ~ generation       = 1 -> (known after apply)
            name             = "app-front"
          ~ resource_version = "1157433" -> (known after apply)
          ~ uid              = "65617300-44c0-49ab-82e5-cb6534870a83" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "app-front"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                              ~ path   = "/livez" -> "/api/livez"
                                # (2 unchanged attributes hidden)
                            }
                        }

                      ~ port {
                          - host_port      = 0 -> null
                            name           = "http"
                            # (2 unchanged attributes hidden)
                        }

                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # module.prod_apps.kubernetes_deployment.auth_microservice will be updated in-place
  ~ resource "kubernetes_deployment" "auth_microservice" {
        id               = "greenmile-prod/auth-microservice"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "auth-microservice"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler_v2.auth_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "auth_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.prod_apps.kubernetes_horizontal_pod_autoscaler_v2.front_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "front_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "front-autoscaler"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 10
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "app-front"
            }
        }
    }

  # module.prod_apps.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "front"
                          + service_port = "http"
                        }
                    }
                }
            }
        }
    }

  # module.prod_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "prod"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.prod_apps.kubernetes_service.front will be created
  + resource "kubernetes_service" "front" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + name             = "front"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"  = "greenmile"
              + "env"  = "prod"
              + "side" = "frontend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "LoadBalancer"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.stg_apps.kubernetes_deployment.app_front will be updated in-place
  ~ resource "kubernetes_deployment" "app_front" {
        id               = "greenmile-stg/app-front"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "app-front"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "app-front"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/hackathon-climat-05/app-front:stg-main-1e79f53-1656265966" -> "ghcr.io/hackathon-climat-05/app-front:stg-main-f20cc5a-1656331750"
                        name                       = "app-front"
                        # (8 unchanged attributes hidden)

                      ~ liveness_probe {
                            # (5 unchanged attributes hidden)

                          ~ http_get {
                              ~ path   = "/livez" -> "/api/livez"
                                # (2 unchanged attributes hidden)
                            }
                        }


                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (1 unchanged block hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.stg_apps.kubernetes_deployment.auth_microservice will be updated in-place
  ~ resource "kubernetes_deployment" "auth_microservice" {
        id               = "greenmile-stg/auth-microservice"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu    = "1"
                                      - memory = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu    = "250m"
                                      - memory = "50Mi"
                                    }
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                  - name     = "auth-microservice"
                                  - requests = {
                                      - cpu               = "250m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "512Mi"
                                    }
                                },
                            ]
                        }
                    }
                ) -> null
            }
            name             = "auth-microservice"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)



                      ~ resources {
                          ~ limits   = {
                              ~ "cpu"               = "250m" -> "1"
                              - "ephemeral-storage" = "1Gi" -> null
                                # (1 unchanged element hidden)
                            }
                          ~ requests = {
                              - "ephemeral-storage" = "1Gi" -> null
                              ~ "memory"            = "512Mi" -> "50Mi"
                                # (1 unchanged element hidden)
                            }
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                        # (2 unchanged blocks hidden)
                    }

                  - security_context {
                      - run_as_non_root     = false -> null
                      - supplemental_groups = [] -> null

                      - seccomp_profile {
                          - type = "RuntimeDefault" -> null
                        }
                    }
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler_v2.auth_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "auth_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "auth-autoscaler"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 5
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "auth-microservice"
            }
        }
    }

  # module.stg_apps.kubernetes_horizontal_pod_autoscaler_v2.front_autoscaler will be created
  + resource "kubernetes_horizontal_pod_autoscaler_v2" "front_autoscaler" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "stg"
              + "side" = "frontend"
            }
          + name             = "front-autoscaler"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + max_replicas                      = 5
          + min_replicas                      = 2
          + target_cpu_utilization_percentage = (known after apply)

          + metric {
              + type = "Resource"

              + resource {
                  + name = "cpu"

                  + target {
                      + average_utilization = 50
                      + type                = "Utilization"
                    }
                }
            }

          + scale_target_ref {
              + kind = "Deployment"
              + name = "app-front"
            }
        }
    }

  # module.stg_apps.kubernetes_ingress.app_ingress will be created
  + resource "kubernetes_ingress" "app_ingress" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app"  = "greenmile"
              + "env"  = "stg"
              + "side" = "frontend"
            }
          + name             = "app-ingress"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {

          + rule {
              + http {
                  + path {
                      + path = "/*"

                      + backend {
                          + service_name = "front"
                          + service_port = "http"
                        }
                    }
                }
            }
        }
    }

  # module.stg_apps.kubernetes_service.auth will be created
  + resource "kubernetes_service" "auth" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "auth"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + ip_families                 = (known after apply)
          + ip_family_policy            = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "app"          = "greenmile"
              + "env"          = "stg"
              + "microservice" = "auth"
              + "side"         = "backend"
            }
          + session_affinity            = "ClientIP"
          + type                        = "ClusterIP"

          + port {
              + name        = "http"
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "http"
            }
        }
    }

  # module.stg_apps.kubernetes_service.front will be updated in-place
  ~ resource "kubernetes_service" "front" {
        id                     = "greenmile-stg/front"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cloud.google.com/neg" = jsonencode(
                    {
                      - ingress = true
                    }
                ) -> null
            }
            name             = "front"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 10 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @au2001, Action: `pull_request`*